БухЭксп/Catalogs/CW_Грузы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Грузы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОпасности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_КлассификаторОпасныхГрузов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыСубъектовСвязанныхПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыСубъектовСвязанныхПараметров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маршрут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Груз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Типоразмер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МенеджерПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперативныйМенеджер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_Грузы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Предопределенные значения параметров
	ВидСубъекта = Перечисления.CW_ВидыСубъектовСвязанныхПараметров.Груз;
	CW_Отчеты.ДобавитьОтборКомпоновкиДанных("ВидСубъекта", ВидСравненияКомпоновкиДанных.Равно, ВидСубъекта, Истина, ПредопределенныеЗначенияПараметров.Отбор);
	_УправлениеЭлементамиФормы_ПредопределенныеЗначенияПараметров();
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	CW_ПраваДоступа.УстановитьПраваДляФормы(ЭтаФорма);
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	_УправлениеЭлементамиФормы_ПредопределенныеЗначенияПараметров();
	
КонецПроцедуры

// Предопределенные значения параметров

Процедура _УправлениеЭлементамиФормы_ПредопределенныеЗначенияПараметров()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Элементы.СтраницаПредопределенныеЗначения.Видимость = Истина;
		CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Субъект", ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, ПредопределенныеЗначенияПараметров.Отбор);
		
	Иначе 
		Элементы.СтраницаПредопределенныеЗначения.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура КодТНВЭДПриИзмененииНаСервере()
	
	Объект.Наименование = Объект.КодТНВЭД.Наименование;
	Объект.ПолноеНаименование = Объект.КодТНВЭД.НаименованиеПолное;
	
КонецПроцедуры

&НаКлиенте
Процедура КодТНВЭДПриИзменении(Элемент)
	КодТНВЭДПриИзмененииНаСервере();
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
